# GetSectionData Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PanelScheduleData..::..GetSectionData Method
PanelScheduleData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSectionData(Int32) | Returns the section data array element at the specified index.  (Inherited from TableData.) |
| GetSectionData(SectionType) | Returns the pointer to the section data array element at the specified section type.  (Inherited from TableData.) |

# See Also
PanelScheduleData Class
PanelScheduleData Members
Autodesk.Revit.DB.Electrical Namespace